Repository: ohel/matrix-orbital-quod-libet-plugin
Catalog: *.po
Languages: fi

source: Disc
fi: Levy

source: Track
fi: Raita

source: Print info to a Matrix Orbital MX2/MX3 LCD.
fi: Tulosta tietoa Matrix Orbital MX2/MX3 LCD:lle.

source: LCD serial device path:
fi: LCD-sarjalaitteen polku:

source: LCD device width (characters):
fi: LCD-laitteen leveys (merkkiä):

source: LCD update interval (ms):
fi: LCD:n päivitysintervalli (ms):

source: Seeking...
fi: Haetaan...

source: * now playing *
fi: * toistetaan *

source: * not playing *
fi: * ei toistoa *

source: * paused *
fi: * katkolla *
